app/controllers/epicenter_controller.rb

  def feed
  		@following_tweets = []

      Tweet.all.each do |tweet|
---
SELECT "tweets".* FROM "tweets"

  def show_user
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def now_following
  # We are adding the user.id of the user you want to
  # follow to your following array.
  # and we want to make sure it's saved in there as an integer

  	current_user.following.push(params[:id].to_i)
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 0\n"], ["updated_at", "2018-03-30 14:38:18.870378"], ["id", 2]]

  def unfollow
    current_user.following.delete(params[:id].to_i)
    current_user.save
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", nil], ["updated_at", "2018-03-30 14:39:13.779054"], ["id", 2]]

  def all_users
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC

 def following
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def tag_tweets
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]