app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?)
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#awesosme"], ["created_at", "2018-03-31 20:36:13.308727"], ["updated_at", "2018-03-31 20:36:13.308727"]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "Princess bride <a href='/tag_tweets?id=1'>#awesosme</a>"], ["updated_at", "2018-03-31 20:36:13.337199"], ["id", 13]]
---
  def create

    @tweet = Tweet.create(tweet_params)

    @tweet = get_tagged(@tweet)

    respond_to do |format|
      if @tweet.save